src/cfe/КСП/InformationRegisters/ксп_Версии_Документ_ВнесениеДенежныхСредствВКассуККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ксп_Версии_Документ_ВнесениеДенежныхСредствВКассуККМ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВерсияДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МоментЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДанныеСсылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнесениеДенежныхСредствВКассуККМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/КСП/InformationRegisters/ксп_Версии_Документ_ВнесениеДенежныхСредствВКассуККМ/Ext/ManagerModule.bsl
// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
Процедура ДобавитьЗапись(ВнешняяСистема, ДанныеСсылка, ВерсияДанных) Экспорт
	
	НаборЗаписей = РегистрыСведений.ксп_Версии_Документ_ВнесениеДенежныхСредствВКассуККМ
		                                     .СоздатьНаборЗаписей();
											 
	НаборЗаписей.Отбор.ВнешняяСистема.Установить(ВнешняяСистема);
	НаборЗаписей.Отбор.ДанныеСсылка.Установить(ДанныеСсылка);
	
	НовСтр = НаборЗаписей.Добавить();
	НовСтр.ВнешняяСистема = ВнешняяСистема;
	НовСтр.ДанныеСсылка = ДанныеСсылка;
	НовСтр.ВерсияДанных = ВерсияДанных;
	НовСтр.МоментЗаписи = ТекущаяДатаСеанса();
	
	НаборЗаписей.Записать();
КонецПроцедуры
